---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult
source: html/7f028cdc-ad5f-a349-b3e7-8c7d2e65ded0.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationMappingResult

Possible results from setting the mapping from Family symbols to Fabrication part types.

## Syntax (C#)
```csharp
public enum DesignToFabricationMappingResult
```